Podkova/src/Catalogs/СостоянияПроцессов/СостоянияПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СостоянияПроцессов</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ПроцессыПродаж</name>
      <description>Процессы продаж</description>
    </items>
  </predefined>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Podkova/src/Catalogs/СостоянияПроцессов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

// Заполняет реквизиты дополнительного упорядочивания этапов процессов продаж.
// Вызывается при первоначальном заполнении ИБ.
//
Процедура НачальноеЗаполнениеПоследовательностиЭтаповПроцессовПродаж() Экспорт
	
	Этапы = Новый Соответствие;
	Этапы.Вставить(Справочники.СостоянияПроцессов.НоваяСделка,                       1);
	Этапы.Вставить(Справочники.СостоянияПроцессов.ПервичныйКонтакт,                  2);
	Этапы.Вставить(Справочники.СостоянияПроцессов.КвалификацияКлиента,               3);
	Этапы.Вставить(Справочники.СостоянияПроцессов.ФормированиеПредложения,           4);
	Этапы.Вставить(Справочники.СостоянияПроцессов.Презентация,                       5);
	Этапы.Вставить(Справочники.СостоянияПроцессов.ДоработкаПредложения,              6);
	Этапы.Вставить(Справочники.СостоянияПроцессов.СогласованиеУсловий,               7);
	Этапы.Вставить(Справочники.СостоянияПроцессов.ПодготовкаКВыполнениюОбязательств, 8);
	Этапы.Вставить(Справочники.СостоянияПроцессов.ВыполнениеОбязательств,            9);
	
	Для Каждого Этап Из Этапы Цикл
		ЭтапОбъект = Этап.Ключ.ПолучитьОбъект();
		ЭтапОбъект.РеквизитДопУпорядочивания = Этап.Значение;
		ЭтапОбъект.Описание                  = ОписаниеПредопределенногоСостоянияПроцесса(Этап.Ключ);
		ЭтапОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

Функция ОписаниеПредопределенногоСостоянияПроцесса(ЭтапПроцесса);
	
	Если ЭтапПроцесса = Справочники.СостоянияПроцессов.НоваяСделка Тогда
	
		Возврат НСтр("ru = 'Данный этап отражает факт того, что сделка была зарегистрирована, но никаких других работ по не не проводилось'");
	
	ИначеЕсли ЭтапПроцесса = Справочники.СостоянияПроцессов.ПервичныйКонтакт Тогда
	
		Возврат НСтр("ru = 'На данном этапе необходимо зарегистрировать первичное взаимодействие с клиентом.'");
		
	ИначеЕсли ЭтапПроцесса = Справочники.СостоянияПроцессов.КвалификацияКлиента Тогда
	
		Возврат НСтр("ru = 'На данном этапе клиент должен быть определен и зарегистрирован в качестве партнера.'");
		
	ИначеЕсли ЭтапПроцесса = Справочники.СостоянияПроцессов.ФормированиеПредложения Тогда
	
		Возврат НСтр("ru = 'Данный этап посвящен формированию коммерческого предложения.'");
		
	ИначеЕсли ЭтапПроцесса = Справочники.СостоянияПроцессов.Презентация Тогда
	
		Возврат НСтр("ru = 'Данный этап посвящен презентации, если таковая необходима.'");
		
	ИначеЕсли ЭтапПроцесса = Справочники.СостоянияПроцессов.ДоработкаПредложения Тогда
	
		Возврат НСтр("ru = 'Данный этап посвящен доработке коммерческого предложения, если таковая необходима.'");
		
	ИначеЕсли ЭтапПроцесса = Справочники.СостоянияПроцессов.СогласованиеУсловий Тогда
	
		Возврат НСтр("ru = 'На данном этапе должно быть определено соглашение с клиентом, определяющее условия продаж.'");
		
	ИначеЕсли ЭтапПроцесса = Справочники.СостоянияПроцессов.ПодготовкаКВыполнениюОбязательств Тогда
	
		Возврат НСтр("ru = 'Данный этап посвящен подготовке к выполнению обязательств по сделке.'");
		
	ИначеЕсли ЭтапПроцесса = Справочники.СостоянияПроцессов.ВыполнениеОбязательств Тогда
	
		Возврат НСтр("ru = 'На данном этапе должны быть оплачены и отгружены все товары по сделке.'");
	
	Иначе
	
		Возврат "";
	
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
